Revit 2027 API
BuiltInFailures.TrussFailures.TrussUserDefinedMemberDeleted Property
 A user-defined structural member was deleted due to missing or deleted references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussUserDefinedMemberDeleted { get; }
Public Shared ReadOnly Property TrussUserDefinedMemberDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussUserDefinedMemberDeleted {
	FailureDefinitionId^ get ();
}
static member TrussUserDefinedMemberDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace